## 데이터 임시 만들기 파일

In [5]:
import numpy as np
import pandas as pd

In [6]:
col = ['user_id', 'name', 'age', 'country']

In [7]:
data = [[1,'Alice', 25, 'US'], [2, 'Bob', 32, 'KR'], [3, 'Charlie', 29, 'JP']]

In [10]:
df = pd.DataFrame(data, columns=col)

In [11]:
df

   user_id     name  age country
0        1    Alice   25      US
1        2      Bob   32      KR
2        3  Charlie   29      JP

In [16]:
# 임시 user data -> csv로
df.to_csv('sample_user_data.csv', index=False)